In [1]:
import sqlite3
import pandas as pd

In [18]:
# Создаем коннектор к файлу нашей базы данных. 
# Само собой, файлик Базы Данных должен лежать рядом с файлом блокнота (который вы сейчас читаете). 
con = sqlite3.connect('DBnameDZ.db')

In [19]:
# Не спрашивайте
cur = con.cursor()

In [21]:
cur.execute('SELECT * FROM EmployeePoints').fetchall()

[('Маша', 5, '2020-01-01'),
 ('Петя', 4, '2020-01-01'),
 ('Вася', 3, '2020-01-01'),
 ('Саша', 4, '2020-01-01'),
 ('Маша', 4, '2020-01-02'),
 ('Петя', 4, '2020-01-02'),
 ('Вася', 4, '2020-01-02'),
 ('Саша', 5, '2020-01-02'),
 ('Маша', 5, '2020-01-03'),
 ('Петя', 3, '2020-01-03'),
 ('Вася', 2, '2020-01-03'),
 ('Саша', 5, '2020-01-03'),
 ('Маша', 3, '2020-01-04'),
 ('Петя', 3, '2020-01-04'),
 ('Вася', 3, '2020-01-04'),
 ('Саша', 3, '2020-01-04'),
 ('Максим', 2, '2020-01-04'),
 ('Маша', 5, '2020-01-05'),
 ('Петя', 3, '2020-01-05'),
 ('Вася', 3, '2020-01-05'),
 ('Саша', 3, '2020-01-05')]

In [31]:
df = pd.read_sql("""
    select distinct Employee from EmployeePoints
        group by Employee
""", con)
df

  Employee
0     Вася
1   Максим
2     Маша
3     Петя
4     Саша

In [32]:
df = pd.read_sql("""
    select Employee, count(Point) from EmployeePoints 
        where point = 5 
        group by Employee  
        order by point
""", con)
df

  Employee  COUNT(Point)
0     Маша             3
1     Саша             2